# LeetCode Python & Pandas Solutions (Teacher Version)

This notebook contains **complete solutions with detailed explanations** for 8 LeetCode problems.

## Problems Covered

| # | Problem | Difficulty | Key Concepts |
|---|---------|------------|-------------|
| 1 | Combine Two Tables (175) | Easy | LEFT JOIN, merge() |
| 2 | Roman to Integer (13) | Easy | Dictionary, Iteration |
| 3 | Duplicate Emails (182) | Easy | groupby(), filtering |
| 4 | Game Play Analysis I (511) | Easy | groupby(), min() |
| 5 | Reshape Data: Concatenate (2888) | Easy | pd.concat() |
| 6 | Invalid Tweets (1683) | Easy | str.len(), filtering |
| 7 | Reshape Data: Pivot (2889) | Easy | pivot() |
| 8 | Biggest Single Number (619) | Easy | value_counts(), max() |

In [1]:
# Import required libraries
import pandas as pd
import numpy as np

# Import test cases module
import test_cases as tc

print("Libraries imported successfully!")

Libraries imported successfully!

---
# Problem 1: Combine Two Tables (LeetCode 175)

## Problem Description

Write a solution to report the **first name**, **last name**, **city**, and **state** of each person in the Person table. If the address of a personId is not present in the Address table, report `null` instead.

## Key Concepts

### LEFT JOIN
A LEFT JOIN returns all records from the left table, and the matched records from the right table. If there is no match, the result is NULL on the right side.

```
Person (LEFT)          Address (RIGHT)
+----------+           +----------+
| personId |           | personId |
+----------+           +----------+
| 1        | --------> | (no match) = NULL
| 2        | --------> | 2        |
+----------+           +----------+
```

### pandas.merge()
- `how='left'`: Keep all rows from the left DataFrame
- `on='column_name'`: The column to join on

In [2]:
# View the test data
person, address = tc.get_combine_two_tables_data()
print("Person Table:")
display(person)
print("\nAddress Table:")
display(address)

Person Table:

   personId lastName firstName
0         1     Wang     Allen
1         2    Alice       Bob

Address Table:

   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

In [3]:
# SOLUTION
def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    """
    Combine Person and Address tables to report firstName, lastName, city, and state.
    
    Approach:
    1. Use LEFT JOIN (merge with how='left') to keep all persons
    2. Join on personId column
    3. Select only the required columns
    
    Time Complexity: O(n + m) where n, m are the sizes of the tables
    Space Complexity: O(n) for the result
    """
    # Step 1: Perform LEFT JOIN
    # We use 'left' to ensure all persons are included even without addresses
    merged = pd.merge(person, address, on='personId', how='left')
    
    # Step 2: Select and reorder the required columns
    result = merged[['firstName', 'lastName', 'city', 'state']]
    
    return result

# Show the result
result = combine_two_tables(person.copy(), address.copy())
print("Result:")
display(result)

Result:

  firstName lastName           city     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  New York City  New York

In [4]:
# Test the solution
tc.test_combine_two_tables(combine_two_tables)

✅ All tests passed for Combine Two Tables!

True

### Explanation

1. **Why LEFT JOIN?**
   - We need ALL persons from the Person table
   - If a person has no address, we still want to include them with NULL values
   - INNER JOIN would exclude persons without addresses

2. **Alternative Approaches:**
   ```python
   # Using join() method
   person.set_index('personId').join(address.set_index('personId'), how='left')
   ```

3. **Common Mistakes:**
   - Using INNER JOIN instead of LEFT JOIN
   - Forgetting to select only the required columns

---
# Problem 2: Roman to Integer (LeetCode 13)

## Problem Description

Convert a Roman numeral to an integer. Roman numerals have special subtraction rules:
- I before V or X means subtract (IV=4, IX=9)
- X before L or C means subtract (XL=40, XC=90)
- C before D or M means subtract (CD=400, CM=900)

## Key Concepts

### Algorithm
Iterate through the string. If the current value is less than the next value, subtract it; otherwise, add it.

```
Example: MCMXCIV = 1994

M  = 1000 (M > C, add)     -> total = 1000
C  = 100  (C < M, subtract) -> total = 900
M  = 1000 (already subtracted above)
X  = 10   (X < C, subtract) -> total = 890
C  = 100  (already subtracted above)
I  = 1    (I < V, subtract) -> total = 889
V  = 5    (already subtracted above)

Actually, simpler approach:
M=1000, C<M so -100, M=1000, X<C so -10, C=100, I<V so -1, V=5
1000 - 100 + 1000 - 10 + 100 - 1 + 5 = 1994
```

In [5]:
# SOLUTION
def roman_to_integer(s: str) -> int:
    """
    Convert a Roman numeral string to an integer.
    
    Approach:
    1. Create a mapping of Roman symbols to their values
    2. Iterate through the string
    3. If current value < next value, subtract current from total
    4. Otherwise, add current to total
    
    Time Complexity: O(n) where n is the length of the string
    Space Complexity: O(1) - fixed size dictionary
    """
    # Step 1: Define the Roman numeral values
    roman_values = {
        'I': 1,
        'V': 5,
        'X': 10,
        'L': 50,
        'C': 100,
        'D': 500,
        'M': 1000
    }
    
    total = 0
    
    # Step 2: Iterate through the string
    for i in range(len(s)):
        # Get current value
        current_value = roman_values[s[i]]
        
        # Check if there's a next character and if current < next
        if i + 1 < len(s) and current_value < roman_values[s[i + 1]]:
            # Subtraction case: subtract current value
            total -= current_value
        else:
            # Addition case: add current value
            total += current_value
    
    return total

# Demonstrate with examples
examples = ["III", "LVIII", "MCMXCIV", "IV", "IX"]
for roman in examples:
    print(f"{roman} = {roman_to_integer(roman)}")

III = 3
LVIII = 58
MCMXCIV = 1994
IV = 4
IX = 9

In [6]:
# Test the solution
tc.test_roman_to_integer(roman_to_integer)

✓ Passed: III = 3
✓ Passed: LVIII = 58
✓ Passed: MCMXCIV = 1994
✓ Passed: IV = 4
✓ Passed: IX = 9
✓ Passed: XL = 40
✓ Passed: XC = 90
✓ Passed: CD = 400
✓ Passed: CM = 900
✓ Passed: MMXXIII = 2023
✓ Passed: I = 1
✓ Passed: MMMCMXCIX = 3999

✅ All tests passed for Roman to Integer!

True

### Step-by-Step Walkthrough: MCMXCIV

| Position | Char | Value | Next Value | Action | Total |
|----------|------|-------|------------|--------|-------|
| 0 | M | 1000 | C=100 | 1000 > 100, ADD | 1000 |
| 1 | C | 100 | M=1000 | 100 < 1000, SUBTRACT | 900 |
| 2 | M | 1000 | X=10 | 1000 > 10, ADD | 1900 |
| 3 | X | 10 | C=100 | 10 < 100, SUBTRACT | 1890 |
| 4 | C | 100 | I=1 | 100 > 1, ADD | 1990 |
| 5 | I | 1 | V=5 | 1 < 5, SUBTRACT | 1989 |
| 6 | V | 5 | (none) | ADD | 1994 |

### Alternative Solution
You can also pre-process special cases:

In [7]:
# Alternative solution with replacement
def roman_to_integer_v2(s: str) -> int:
    """
    Alternative approach: Replace special cases first, then sum values.
    """
    # Replace special cases with single-character placeholders
    replacements = {
        'IV': 'a',  # 4
        'IX': 'b',  # 9
        'XL': 'c',  # 40
        'XC': 'd',  # 90
        'CD': 'e',  # 400
        'CM': 'f'   # 900
    }
    
    for old, new in replacements.items():
        s = s.replace(old, new)
    
    values = {
        'I': 1, 'V': 5, 'X': 10, 'L': 50, 'C': 100, 'D': 500, 'M': 1000,
        'a': 4, 'b': 9, 'c': 40, 'd': 90, 'e': 400, 'f': 900
    }
    
    return sum(values[char] for char in s)

print(f"MCMXCIV = {roman_to_integer_v2('MCMXCIV')}")

MCMXCIV = 1994

---
# Problem 3: Duplicate Emails (LeetCode 182)

## Problem Description

Find all duplicate emails in the Person table.

## Key Concepts

### groupby() and size()
- `groupby('column')`: Group rows by unique values
- `size()`: Count the number of rows in each group
- Filter for counts > 1 to find duplicates

In [8]:
# View the test data
person = tc.get_duplicate_emails_data()
print("Person Table:")
display(person)

Person Table:

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [9]:
# SOLUTION
def duplicate_emails(person: pd.DataFrame) -> pd.DataFrame:
    """
    Find all duplicate emails in the Person table.
    
    Approach:
    1. Group by email
    2. Count occurrences of each email
    3. Filter for emails with count > 1
    
    Time Complexity: O(n) for grouping
    Space Complexity: O(n) for storing groups
    """
    # Step 1: Group by email and count
    email_counts = person.groupby('email').size().reset_index(name='count')
    
    # Step 2: Filter for duplicates (count > 1)
    duplicates = email_counts[email_counts['count'] > 1]
    
    # Step 3: Return only the Email column
    result = duplicates[['email']].rename(columns={'email': 'Email'})
    
    return result

# Show the result
result = duplicate_emails(person.copy())
print("Result:")
display(result)

Result:

     Email
0  a@b.com

In [10]:
# Test the solution
tc.test_duplicate_emails(duplicate_emails)

✅ All tests passed for Duplicate Emails!

True

### Alternative Approaches

In [11]:
# Alternative 1: Using value_counts()
def duplicate_emails_v2(person: pd.DataFrame) -> pd.DataFrame:
    counts = person['email'].value_counts()
    duplicates = counts[counts > 1].index.tolist()
    return pd.DataFrame({'Email': duplicates})

# Alternative 2: Using duplicated()
def duplicate_emails_v3(person: pd.DataFrame) -> pd.DataFrame:
    duplicates = person[person.duplicated(subset=['email'], keep=False)]
    return duplicates[['email']].drop_duplicates().rename(columns={'email': 'Email'})

print("Alternative 1 (value_counts):")
display(duplicate_emails_v2(person.copy()))

print("\nAlternative 2 (duplicated):")
display(duplicate_emails_v3(person.copy()))

Alternative 1 (value_counts):

     Email
0  a@b.com

Alternative 2 (duplicated):

     Email
0  a@b.com

---
# Problem 4: Game Play Analysis I (LeetCode 511)

## Problem Description

Find the first login date for each player.

## Key Concepts

### groupby() with aggregation
- Use `min()` to find the earliest date per group
- `reset_index()` to convert the grouped result back to a DataFrame

In [12]:
# View the test data
activity = tc.get_game_play_analysis_data()
print("Activity Table:")
display(activity)

Activity Table:

   player_id  device_id event_date  games_played
0          1          2 2016-03-01             5
1          1          2 2016-05-02             6
2          2          3 2017-06-25             1
3          3          1 2016-03-02             0
4          3          4 2018-07-03             5

In [13]:
# SOLUTION
def game_play_analysis(activity: pd.DataFrame) -> pd.DataFrame:
    """
    Find the first login date for each player.
    
    Approach:
    1. Group by player_id
    2. Find the minimum (earliest) event_date for each player
    3. Rename the column to first_login
    
    Time Complexity: O(n log n) for sorting within groups
    Space Complexity: O(n) for storing groups
    """
    # Step 1: Group by player_id and find minimum event_date
    result = activity.groupby('player_id')['event_date'].min().reset_index()
    
    # Step 2: Rename the column
    result.columns = ['player_id', 'first_login']
    
    return result

# Show the result
result = game_play_analysis(activity.copy())
print("Result:")
display(result)

Result:

   player_id first_login
0          1  2016-03-01
1          2  2017-06-25
2          3  2016-03-02

In [14]:
# Test the solution
tc.test_game_play_analysis(game_play_analysis)

✅ All tests passed for Game Play Analysis I!

True

### Visual Explanation

```
Original Activity Table:
player_id | event_date
    1     | 2016-03-01  <- earliest for player 1
    1     | 2016-05-02
    2     | 2017-06-25  <- only date for player 2
    3     | 2016-03-02  <- earliest for player 3
    3     | 2018-07-03

After groupby('player_id').min():
player_id | first_login
    1     | 2016-03-01
    2     | 2017-06-25
    3     | 2016-03-02
```

---
# Problem 5: Reshape Data: Concatenate (LeetCode 2888)

## Problem Description

Concatenate two DataFrames vertically into one DataFrame.

## Key Concepts

### pd.concat()
- Stack DataFrames on top of each other
- `ignore_index=True` to reset the index

In [15]:
# View the test data
df1, df2 = tc.get_concatenate_data()
print("DataFrame 1:")
display(df1)
print("\nDataFrame 2:")
display(df2)

DataFrame 1:

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17

DataFrame 2:

   student_id  name  age
0           5   Leo    7
1           6  Alex    7

In [16]:
# SOLUTION
def concatenate_dataframes(df1: pd.DataFrame, df2: pd.DataFrame) -> pd.DataFrame:
    """
    Concatenate two DataFrames vertically.
    
    Approach:
    1. Use pd.concat() to stack DataFrames vertically
    2. Use ignore_index=True to reset row indices
    
    Time Complexity: O(n + m) where n, m are the sizes of the DataFrames
    Space Complexity: O(n + m) for the result
    """
    # Concatenate vertically (axis=0 is default)
    result = pd.concat([df1, df2], ignore_index=True)
    
    return result

# Show the result
result = concatenate_dataframes(df1.copy(), df2.copy())
print("Result:")
display(result)

Result:

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
4           5      Leo    7
5           6     Alex    7

In [17]:
# Test the solution
tc.test_concatenate(concatenate_dataframes)

✅ All tests passed for Reshape Data: Concatenate!

True

### pd.concat() Parameters

| Parameter | Default | Description |
|-----------|---------|------------|
| `axis` | 0 | 0=vertical (rows), 1=horizontal (columns) |
| `ignore_index` | False | If True, reset index in result |
| `join` | 'outer' | How to handle columns: 'inner' or 'outer' |

---
# Problem 6: Invalid Tweets (LeetCode 1683)

## Problem Description

Find tweet IDs where content length is strictly greater than 15 characters.

## Key Concepts

### String operations in pandas
- `.str.len()`: Get the length of each string
- Boolean filtering with conditions

In [18]:
# View the test data
tweets = tc.get_invalid_tweets_data()
print("Tweets Table:")
display(tweets)
print("\nContent lengths:")
print(tweets['content'].str.len())

Tweets Table:

   tweet_id                            content
0         1                        Let us Code
1         2  More than fifteen chars are here!

Content lengths:
0    11
1    33
Name: content, dtype: int64

In [19]:
# SOLUTION
def invalid_tweets(tweets: pd.DataFrame) -> pd.DataFrame:
    """
    Find tweet IDs where content length is greater than 15.
    
    Approach:
    1. Calculate the length of each tweet's content
    2. Filter for tweets where length > 15
    3. Return only the tweet_id column
    
    Time Complexity: O(n) for string length calculation
    Space Complexity: O(n) for the result
    """
    # Step 1: Filter for invalid tweets (content length > 15)
    invalid = tweets[tweets['content'].str.len() > 15]
    
    # Step 2: Return only tweet_id
    result = invalid[['tweet_id']]
    
    return result

# Show the result
result = invalid_tweets(tweets.copy())
print("Result:")
display(result)

Result:

   tweet_id
1         2

In [20]:
# Test the solution
tc.test_invalid_tweets(invalid_tweets)

✅ All tests passed for Invalid Tweets!

True

### Common String Methods in Pandas

| Method | Description |
|--------|------------|
| `.str.len()` | Length of each string |
| `.str.lower()` | Convert to lowercase |
| `.str.upper()` | Convert to uppercase |
| `.str.contains()` | Check if pattern exists |
| `.str.startswith()` | Check if starts with pattern |
| `.str.strip()` | Remove leading/trailing whitespace |

---
# Problem 7: Reshape Data: Pivot (LeetCode 2889)

## Problem Description

Pivot the weather data so that each row represents a month and each city is a separate column.

## Key Concepts

### pivot() vs pivot_table()
- `pivot()`: Simple reshaping, no aggregation
- `pivot_table()`: Allows aggregation (mean, sum, etc.)

```
Before (Long format):          After (Wide format):
city    | month   | temp       month   | ElPaso | Jacksonville
ElPaso  | January | 20         January | 20     | 13
Jack... | January | 13         ...
```

In [21]:
# View the test data
weather = tc.get_pivot_data()
print("Weather Table:")
display(weather)

Weather Table:

           city     month  temperature
0  Jacksonville   January           13
1  Jacksonville  February           23
2  Jacksonville     March           38
3  Jacksonville     April            5
4  Jacksonville       May           34
5        ElPaso   January           20
6        ElPaso  February            6
7        ElPaso     March           26
8        ElPaso     April            2
9        ElPaso       May           43

In [22]:
# SOLUTION
def pivot_weather(weather: pd.DataFrame) -> pd.DataFrame:
    """
    Pivot the weather data so each row is a month and each column is a city.
    
    Approach:
    1. Use pivot() to reshape the data
    2. Reset the index to make month a column
    3. Optionally rename the column index
    
    Time Complexity: O(n) for the pivot operation
    Space Complexity: O(n) for the result
    """
    # Step 1: Pivot the data
    # - index: what becomes the rows (month)
    # - columns: what becomes the columns (city)
    # - values: what fills the cells (temperature)
    pivoted = weather.pivot(index='month', columns='city', values='temperature')
    
    # Step 2: Reset index to make month a column
    result = pivoted.reset_index()
    
    # Step 3: Remove the column index name
    result.columns.name = None
    
    return result

# Show the result
result = pivot_weather(weather.copy())
print("Result:")
display(result)

Result:

      month  ElPaso  Jacksonville
0     April       2             5
1  February       6            23
2   January      20            13
3     March      26            38
4       May      43            34

In [23]:
# Test the solution
tc.test_pivot(pivot_weather)

✅ All tests passed for Reshape Data: Pivot!

True

### Visual Explanation of pivot()

```
Original Data:
┌─────────────┬──────────┬─────────────┐
│ city        │ month    │ temperature │
├─────────────┼──────────┼─────────────┤
│ Jacksonville│ January  │ 13          │
│ ElPaso      │ January  │ 20          │
│ Jacksonville│ February │ 23          │
│ ElPaso      │ February │ 6           │
└─────────────┴──────────┴─────────────┘

After pivot(index='month', columns='city', values='temperature'):
┌──────────┬────────┬──────────────┐
│ month    │ ElPaso │ Jacksonville │
├──────────┼────────┼──────────────┤
│ January  │ 20     │ 13           │
│ February │ 6      │ 23           │
└──────────┴────────┴──────────────┘
```

---
# Problem 8: Biggest Single Number (LeetCode 619)

## Problem Description

Find the largest number that appears only once. If no such number exists, return null.

## Key Concepts

### Finding unique occurrences
- `value_counts()`: Count occurrences of each value
- Filter for count == 1 (single numbers)
- Find max of remaining numbers
- Handle edge case: no single numbers exist

In [24]:
# View the test data
my_numbers_1 = tc.get_biggest_single_number_data_1()
my_numbers_2 = tc.get_biggest_single_number_data_2()
print("MyNumbers Table (Test 1 - has single numbers):")
display(my_numbers_1)
print("\nValue counts:")
print(my_numbers_1['num'].value_counts())

print("\n" + "="*50)
print("\nMyNumbers Table (Test 2 - all duplicates):")
display(my_numbers_2)
print("\nValue counts:")
print(my_numbers_2['num'].value_counts())

MyNumbers Table (Test 1 - has single numbers):

   num
0    8
1    8
2    3
3    3
4    1
5    4
6    5
7    6

Value counts:
num
8    2
3    2
1    1
4    1
5    1
6    1
Name: count, dtype: int64

==================================================

MyNumbers Table (Test 2 - all duplicates):

   num
0    8
1    8
2    7
3    7
4    3
5    3
6    3

Value counts:
num
3    3
8    2
7    2
Name: count, dtype: int64

In [25]:
# SOLUTION
def biggest_single_number(my_numbers: pd.DataFrame) -> pd.DataFrame:
    """
    Find the largest number that appears only once.
    
    Approach:
    1. Count occurrences of each number
    2. Filter for numbers that appear exactly once
    3. Find the maximum of these single numbers
    4. Return null if no single numbers exist
    
    Time Complexity: O(n) for counting
    Space Complexity: O(n) for storing counts
    """
    # Step 1: Count occurrences of each number
    counts = my_numbers['num'].value_counts()
    
    # Step 2: Filter for single numbers (count == 1)
    single_numbers = counts[counts == 1].index.tolist()
    
    # Step 3: Find the maximum or return null
    if single_numbers:
        biggest = max(single_numbers)
    else:
        biggest = None
    
    # Step 4: Return as DataFrame
    return pd.DataFrame({'num': [biggest]})

# Show results for both test cases
print("Test 1 Result (expected: 6):")
display(biggest_single_number(my_numbers_1.copy()))

print("\nTest 2 Result (expected: null):")
display(biggest_single_number(my_numbers_2.copy()))

Test 1 Result (expected: 6):

   num
0    6

Test 2 Result (expected: null):

    num
0  None

In [26]:
# Test the solution
tc.test_biggest_single_number(biggest_single_number)

✓ Test 1 passed: Correctly found 6 as the biggest single number
✓ Test 2 passed: Correctly returned null when no single number exists

✅ All tests passed for Biggest Single Number!

True

### Step-by-Step Walkthrough (Test Case 1)

```
Input: [8, 8, 3, 3, 1, 4, 5, 6]

Step 1 - Count occurrences:
  8: 2 times
  3: 2 times
  1: 1 time  ← single
  4: 1 time  ← single
  5: 1 time  ← single
  6: 1 time  ← single

Step 2 - Single numbers: [1, 4, 5, 6]

Step 3 - Maximum: 6

Output: 6
```

In [27]:
# Alternative solution using groupby
def biggest_single_number_v2(my_numbers: pd.DataFrame) -> pd.DataFrame:
    """
    Alternative approach using groupby.
    """
    # Group by num and count
    grouped = my_numbers.groupby('num').size().reset_index(name='count')
    
    # Filter for single numbers
    singles = grouped[grouped['count'] == 1]
    
    if len(singles) > 0:
        result = singles['num'].max()
    else:
        result = None
    
    return pd.DataFrame({'num': [result]})

print("Alternative solution result:")
display(biggest_single_number_v2(my_numbers_1.copy()))

Alternative solution result:

   num
0    6

---
# Summary: Key Pandas Operations

## Data Manipulation Cheat Sheet

| Operation | Function | Example |
|-----------|----------|--------|
| **Join tables** | `pd.merge()` | `pd.merge(df1, df2, on='key', how='left')` |
| **Concatenate** | `pd.concat()` | `pd.concat([df1, df2], ignore_index=True)` |
| **Group and aggregate** | `groupby()` | `df.groupby('col')['value'].sum()` |
| **Pivot** | `pivot()` | `df.pivot(index='row', columns='col', values='val')` |
| **Filter rows** | Boolean indexing | `df[df['col'] > 10]` |
| **String length** | `.str.len()` | `df['text'].str.len()` |
| **Count values** | `value_counts()` | `df['col'].value_counts()` |
| **Select columns** | `[[cols]]` | `df[['col1', 'col2']]` |
| **Rename columns** | `rename()` | `df.rename(columns={'old': 'new'})` |

In [28]:
# Run all tests to verify all solutions work
print("="*60)
print("FINAL VERIFICATION - All Solutions")
print("="*60)

solutions = {
    'combine_two_tables': combine_two_tables,
    'roman_to_integer': roman_to_integer,
    'duplicate_emails': duplicate_emails,
    'game_play_analysis': game_play_analysis,
    'concatenate': concatenate_dataframes,
    'invalid_tweets': invalid_tweets,
    'pivot': pivot_weather,
    'biggest_single_number': biggest_single_number
}

tc.run_all_tests(solutions)

============================================================
FINAL VERIFICATION - All Solutions
============================================================
============================================================
Running All LeetCode Tests
============================================================

========================================
Testing: combine_two_tables
========================================
✅ All tests passed for Combine Two Tables!

========================================
Testing: roman_to_integer
========================================
✓ Passed: III = 3
✓ Passed: LVIII = 58
✓ Passed: MCMXCIV = 1994
✓ Passed: IV = 4
✓ Passed: IX = 9
✓ Passed: XL = 40
✓ Passed: XC = 90
✓ Passed: CD = 400
✓ Passed: CM = 900
✓ Passed: MMXXIII = 2023
✓ Passed: I = 1
✓ Passed: MMMCMXCIX = 3999

✅ All tests passed for Roman to Integer!

========================================
Testing: duplicate_emails
========================================
✅ All tests passed for Duplicate Emails!

========================================
Testing: game_play_analysis
========================================
✅ All tests passed for Game Play Analysis I!

========================================
Testing: concatenate
========================================
✅ All tests passed for Reshape Data: Concatenate!

========================================
Testing: invalid_tweets
========================================
✅ All tests passed for Invalid Tweets!

========================================
Testing: pivot
========================================
✅ All tests passed for Reshape Data: Pivot!

========================================
Testing: biggest_single_number
========================================
✓ Test 1 passed: Correctly found 6 as the biggest single number
✓ Test 2 passed: Correctly returned null when no single number exists

✅ All tests passed for Biggest Single Number!

============================================================
Summary
============================================================
Passed: 8/8